public class Main {
    public static void main(String[] args) {

       int price = 10000;
       int pricePerMile = 20;
       int mile = price / pricePerMile;

        System.out.println ("Количество полученых миль " + mile );
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}

